app/controllers/v1/albums_controller.rb

    def index
        @albums = Album.all
---
SELECT "albums".* FROM "albums"