app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "a"], ["email", "al.x.falconer@gmail.com"], ["password", "a"], ["created_at", "2021-07-30 16:28:32.909603"], ["updated_at", "2021-07-30 16:28:32.909603"]]
---
    def create

        @user = User.new(user_params)
        @user.save